# **Data Science Learners Hub**

**Module : SQL**

**Topic :** **TOP, Alias, SELECT Expression**

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

In [ ]:
USE DataScienceLearnersHub

In [2]:
DROP TABLE EMP

In [3]:
CREATE TABLE Emp (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender VARCHAR(10),
    salary DECIMAL(10,2),
    department VARCHAR(50)
);

In [4]:
INSERT INTO Emp (id, name, age, gender, salary, department)
VALUES 
    (1, 'Rajesh', 30, 'Male', 60000.00, 'IT'),
    (2, 'Padma', 25, 'Female', 55000.50, 'HR'),
    (3, 'Laxman', 35, 'Male', 70000.75, 'Finance'),
    (4, 'Ganga', 28, 'Female', 48000.25, 'Marketing'),
    (5, 'Nikhil', 32, 'Male', 72000.00, 'IT'),
    (6, 'Sarita', 29, 'Female', 58000.75, 'HR'),
    (7, 'Bunny', 40, 'Male', 85000.50, 'Finance'),
    (8, 'Namrata', 26, 'Female', 50000.50, 'Marketing'),
    (9, 'Abhiram', 38, 'Male', 78000.25, 'IT'),
    (10, 'Tikram', 31, 'Female', 62000.00, 'Finance'),
    (11, 'Ramulu', 58, 'Male', 178000.25, 'IT'),
    (12, 'Bala', 51, 'Female', 162000.00, 'Finance');

In [5]:
SELECT * FROM Emp

id,name,age,gender,salary,department
1,Rajesh,30,Male,60000.00,IT
2,Padma,25,Female,55000.50,HR
3,Laxman,35,Male,70000.75,Finance
4,Ganga,28,Female,48000.25,Marketing
5,Nikhil,32,Male,72000.00,IT
6,Sarita,29,Female,58000.75,HR
7,Bunny,40,Male,85000.50,Finance
8,Namrata,26,Female,50000.50,Marketing
9,Abhiram,38,Male,78000.25,IT
10,Tikram,31,Female,62000.00,Finance
11,Ramulu,58,Male,178000.25,IT
12,Bala,51,Female,162000.00,Finance

In [14]:
DROP TABLE Department

In [15]:
CREATE TABLE Department (
    id INT PRIMARY KEY,
    department VARCHAR(50)
);

In [16]:
INSERT INTO Department (id, department)
VALUES
    (1, 'IT'),
    (2, 'HR'),
    (3, 'Finance'),
    (4, 'Marketing');

In [17]:
SELECT * FROM Department

id,department
1,IT
2,HR
3,Finance
4,Marketing

### **1\. TOP:**

- The **TOP** keyword in SQL is employed to limit the number of rows returned by a query. It is often used with the **SELECT** statement to specify the maximum number of rows to retrieve from the result set.

**Syntax :**

  

<span style="font-size: 13px;">SELECT TOP (n) column1, column2, ...</span>

<span style="font-size: 13px;">FROM table_name</span>

<span style="font-size: 13px;">WHERE condition;</span>

  

Note : Here **n** <span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;">is t</span><span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;">he number of rows to be returned.</span>

In [6]:
SELECT TOP 5 id, name, age
FROM Emp
ORDER BY id;

-- Note : The output dispalys only top 5 rows out of the total 12 rows

id,name,age
1,Rajesh,30
2,Padma,25
3,Laxman,35
4,Ganga,28
5,Nikhil,32

**2\. ALIAS:**

- In SQL, an alias is a temporary name assigned to a table or column for the duration of a query. Aliases make the output of a query more readable or rename tables or columns in the context of a specific query.
- Aliases are often used to make column names more readable.
- An alias only exists for the duration of the query.

**Syntax for Table Alias :**

<span style="font-size:13px;">SELECT alias_name.column1, alias_name.column2, ...</span>

<span style="font-size:13px;">FROM table_name AS alias_name</span>

<span style="font-size:13px;">WHERE condition;</span>

<span style="font-size:13px;"><br></span>

<span style="font-size:13px;"><b>Syntax for Column Alias :</b></span>

<span style="font-size:13px;font-family:-apple-system, BlinkMacSystemFont, sans-serif;">SELECT column_name AS alias_name</span>

<span style="font-size:13px;">FROM table_name</span>

<span style="font-size:13px;">WHERE condition;</span>

<span style="font-size:13px;"><br></span>

**NOTE** :

- The Alias name cannot be used in WHERE Clause

**Question:**

What is an alias in SQL, and how is it used?

**Answer:**

**Purpose of an Alias:**
- <mark>A temporary name assigned to a table or column</mark> <mark>`for the duration of a query.`</mark>
- Improves readability and renames tables or columns in a specific query.

**Usage of Alias:**
- Makes column names more readable.
- <mark>Exists only for the duration of the query.</mark>

**Syntax for Table Alias:**
```sql
SELECT alias_name.column1, alias_name.column2, ...
FROM table_name AS alias_name
WHERE condition;
```

**Syntax for Column Alias:**
```sql
SELECT column_name AS alias_name
FROM table_name
WHERE condition;
```

**Note:**
- <mark>**`Alias names cannot be used in the WHERE clause`.**</mark>

In [8]:
-- Column Alias example

SELECT id AS EmployeeID, name AS EmployeeName, age AS EmployeeAge
FROM Emp
WHERE id > 5;

EmployeeID,EmployeeName,EmployeeAge
6,Sarita,29
7,Bunny,40
8,Namrata,26
9,Abhiram,38
10,Tikram,31
11,Ramulu,58
12,Bala,51

In [18]:
-- Table Alias Example

SELECT e.id AS EmployeeID, e.name AS EmployeeName, d.department AS EmployeeDepartment
FROM Emp AS e
JOIN Department AS d ON e.department = d.department
WHERE e.salary > 50000;

EmployeeID,EmployeeName,EmployeeDepartment
1,Rajesh,IT
2,Padma,HR
3,Laxman,Finance
5,Nikhil,IT
6,Sarita,HR
7,Bunny,Finance
8,Namrata,Marketing
9,Abhiram,IT
10,Tikram,Finance
11,Ramulu,IT
12,Bala,Finance

**Question:**

What are SELECT expressions in SQL, and how are they used?

**Answer:**

**Definition of SELECT expressions:**
- <mark>Calculate values based on data in columns within a SELECT statement.</mark>
- <mark>Can involve mathematical operations, string concatenation, or function calls.</mark>

**Note:**
- SELECT expressions, like `salary * 1.1 AS IncreasedSalary`,<mark>**` create virtual columns in query results without altering the underlying data in the table.`**</mark>

In [2]:
-- Example: Calculating a 10% salary increase for employees in the "IT" department.
SELECT id, name, age, salary, salary * 1.1 AS IncreasedSalary
FROM Emp
WHERE department = 'IT';

id,name,age,salary,IncreasedSalary
1,Rajesh,30,60000.00,66000.000
5,Nikhil,32,72000.00,79200.000
9,Abhiram,38,78000.25,85800.275
11,Ramulu,58,178000.25,195800.275